app/controllers/products_controller.rb

INSERT INTO "products" ("name", "upc", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Naturis "], ["upc", "20797799"], ["image_url", ""], ["created_at", 2018-06-08 23:17:17 UTC], ["updated_at", 2018-06-08 23:17:17 UTC]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT  "products".* FROM "products" WHERE "products"."upc" = ? LIMIT ?  [["upc", "20797799"], ["LIMIT", 1]]
---
  def get_barcode
    @product = Product.find_or_initialize_by(upc: params[:upc])